<template>
    
  <div class="detail">
      <NavBar :title="title"></NavBar>

      <div class="item">
          <p>新闻标题</p>
          <div>
              <span>2次点击</span>
              <span>分类：民生经济</span>
              <span>添加时间：2019-02-19</span>
          </div>
      </div>
      <div class="divier"></div>
      <div class="detail-content">
            {{details.content}}
      </div>
  </div>
</template>

<script>
import { constants } from 'crypto';

const details = {
    id: 1,
    title: '',
    click: 23,
    add_time: '3066-06-52T12:22:23.000Z',
    content: `新闻明细
            在河坝林社区，各族群众不分彼此、互帮互助，民族团结已经融入居民的日常生活之中。这样良好氛围的形成，离不开社区全体干部职工的辛勤工作。
    　　近年来，河坝林社区本着“民族工作无小事”的原则，坚持将民族团结作为社区工作的重中之重，并不断取得创新。辖区各民族群众在宗教信仰上相互尊重、文化上相互融合、风俗上相互渗透、经济上相互补充，形成了“包容多元、宗教共融、和而不同”的生动局面，推动了民族团结进步创建工作。
    　　经济日报-中国经济网记者了解到，为了做好民族团结工作，河坝林社区持续健全长效机制，不断创新管理手段，推出众多便民措施，服务好各族群众，经常性开展民族团结宣传活动，举办座谈会和表彰会，并派出人员走访慰问，了解社情民意，力所能及解决居民实际困难。每逢春节、藏历新年、雪顿节、古尔邦节等各族传统节日，社区都会邀请各族群众聚会庆祝。居民们载歌载舞，增进了交往、交流、交融。
    　　近年来，在社区全体干部职工和居民群众的共同努力下，河坝林社区的民族团结工作硕果累累。据悉，截至目前，社区已获得民族团结类奖项16个，其中国家级奖项5个、自治区级奖项6个、拉萨市级奖项1个、城关区级奖项2个、街道办事处奖项3个，社区还被评为西藏自治区民族团结示范点、拉萨市“七进”试点单位、少数民族流动人口示范点。
    　　如今的河坝林社区，各族群众相互尊重，相互学习，相互帮助。民族团结之花在这里盛开，各族群众一起建设和谐美丽社区，共同托起“稳稳的幸福”。
        在河坝林社区，各族群众不分彼此、互帮互助，民族团结已经融入居民的日常生活之中。这样良好氛围的形成，离不开社区全体干部职工的辛勤工作。
　　近年来，河坝林社区本着“民族工作无小事”的原则，坚持将民族团结作为社区工作的重中之重，并不断取得创新。辖区各民族群众在宗教信仰上相互尊重、文化上相互融合、风俗上相互渗透、经济上相互补充，形成了“包容多元、宗教共融、和而不同”的生动局面，推动了民族团结进步创建工作。
　　经济日报-中国经济网记者了解到，为了做好民族团结工作，河坝林社区持续健全长效机制，不断创新管理手段，推出众多便民措施，服务好各族群众，经常性开展民族团结宣传活动，举办座谈会和表彰会，并派出人员走访慰问，了解社情民意，力所能及解决居民实际困难。每逢春节、藏历新年、雪顿节、古尔邦节等各族传统节日，社区都会邀请各族群众聚会庆祝。居民们载歌载舞，增进了交往、交流、交融。
　　近年来，在社区全体干部职工和居民群众的共同努力下，河坝林社区的民族团结工作硕果累累。据悉，截至目前，社区已获得民族团结类奖项16个，其中国家级奖项5个、自治区级奖项6个、拉萨市级奖项1个、城关区级奖项2个、街道办事处奖项3个，社区还被评为西藏自治区民族团结示范点、拉萨市“七进”试点单位、少数民族流动人口示范点。`
}

export default {
    // name: 'newsDetail'
    data() {
        return {
            details
        }
    },
    props: ['title'],
    created () {
        console.log(this.$route);

        let id = this.$route.query.id;
        // 发起数据请求
        // axios.get('getnews/${id}')
        //     .then(res => {
        //         console.log(res);
        //         this.details = res.data;
        //     })
        //     .catch(err=> {
        //         console.log('获取新闻详情失败', err);
        //     });
    }


}
</script>

<style scoped>
.detail {
    /* padding-top: 100px; */
}

.item p {
    color: #6ff;
    font-size: 24px;
    font-weight: 600;
}

.item span {
    margin-right: 20px;
    color: #999999;
}

.divider {
    width: 100%;
    height: 1px;
    background-color: #B3B3B3;
    margin: 5px 0;
}

.detail-content {
    padding: 3px 3px;
    padding-bottom: 80px;
    text-align: justify;
    text-indent: 2em;
}
</style>